app/controllers/coins_controller.rb

SELECT "coins".* FROM "coins"
---
  def index
    @coins = Coin.all

INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "sa"], ["acronym", "as"], ["url_image", ""], ["created_at", "2022-06-30 23:59:19.146858"], ["updated_at", "2022-06-30 23:59:19.146858"]]
---
  def create
    @coin = Coin.new(coin_params)

    respond_to do |format|
      if @coin.save

UPDATE "coins" SET "url_image" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["url_image", "https://richardgarcia.net/wp-content/uploads/2017/05/Bitcoin_logo-1024x1024.png"], ["updated_at", "2022-07-19 01:45:59.127469"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @coin.update(coin_params)

DELETE FROM "coins" WHERE "coins"."id" = ?  [["id", 1]]
---
  def destroy
    @coin.destroy

SELECT  "coins".* FROM "coins" WHERE "coins"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def set_coin
      @coin = Coin.find(params[:id])