app/controllers/mini_types_controller.rb

  def index
    @mini_types = MiniType.all
---
SELECT "mini_types".* FROM "mini_types"

  def create
    @mini_type = MiniType.new(mini_type_params)

    respond_to do |format|
      if @mini_type.save
---
INSERT INTO "mini_types" ("name", "acromyn", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Teste"], ["acromyn", "Teste"], ["created_at", "2022-07-18 23:45:09.008341"], ["updated_at", "2022-07-18 23:45:09.008341"]]

  def destroy
    @mini_type.destroy
---
DELETE FROM "mini_types" WHERE "mini_types"."id" = ?  [["id", 1]]

    def set_mini_type
      @mini_type = MiniType.find(params[:id])
---
SELECT  "mini_types".* FROM "mini_types" WHERE "mini_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]